#lang racket

; === EX 0 ===
; Да се напишат изразите във формат на Racket:

; (3 + 5)/2 + sqrt(4^3 - 7*2^2)
(define x1 (+ (/ (+ 3 5) 2) (sqrt (- (expt 4 3) (* 7 (expt 2 2))))))

; (5 + 1/4 + (2 - (3 - (6 + 1/5)))) / 3(6 - 2)(2 - 7)
(define x2 (/ (+ 5 1/4 (- 2 (- 3 (+ 5 1/5)))) (* 3 (- 6 2) (- 2 7))))

;  (15 + 21 + (3 / 15) + (7 - (2 * 2))) / 16
(define x3 (/ (+ 15 21 (/ 3 15) (- 7 (* 2 2))) 16))

; === EX 1 ===
; Да се дефинира функция, проверяваща дали точка с 2 координати лежи в окръжност с център (0, 0) и радиус 4.

(define (is_in_circle x y)
  (if (<= (+ (expt x 2) (expt y 2)) 16) "Yes" "No"))

; === EX 2 ===
; Да се дефинира функцията факториел.

(define (fact n)
  (cond ((= n 1) n)
        (else (* n (fact (- n 1))))))

; === EX 3 ===
; Да се дефинира функцията за числата на Фибоначи.

(define (fib n)
  (cond ((= n 0) 0)
        ((= n 1) 1)
        (else (+ (fib (- n 2)) (fib (- n 1))))))

; === EX 4 ===
; Да се дефинира функция, смятаща сумата на числата от интервала [a, b].

(define (sum_interval a b)
  (cond ((= a b) a)
        (else (+ b (sum_interval a (- b 1))))))

; === EX 5 ===
; Да се дефинира функция, намираща броя на цифрите на естествено число.

(define (count_digits n)
  (cond ((< n 10) 1)
        (else (+ 1 (count_digits (quotient n 10))))))